#Лекция 7 Списъци
#Задача 1. Напишете програма, която чете цели числа въведени от потребителя и ги
#съхранява в списък. Програма трябва да продължи да чете стойности, докато
#потребителят не въведе 0. След това тя трябва да покаже всички стойности, въведени от
#потребителя (с изключение на 0), подредени от най-малката до най-голямата стойност,
#като на всеки ред се появява по една стойност. Използвайте или метода за сортиране,
#или функцията за сортиране на списъци.

sp1 = []
# vavejdat se opredelen broi chisla
n = int(input('write digit how many numbers to enter: '))
for num in range(n):
    num = int(input('enter number: '))
    if num > 0:
        sp1.append(num)
    elif num == 0:
            break
sp1.sort()
print(sp1)