#Задача 2. При анализиране на данни, събрани като част от научен експеримент, може
#да се наложи да се премахнат най-крайните (големите) стойности, преди да се
#извършват някакви други изчисления. Да се създаде списък от стойностите само с n на
#брой положителни числа. Трябва да се създаде ново копие на създаденият списък с
#премахнатите n най-големи елемента и n най-малките елементи. Редът на елементите
#във върнатия списък не трябва да съвпада с реда на елементите в първоначалния
#списък. Напишете програма, която да чете списък от числа въведени от потребителя и
#да премахва двете най-големи и двете най-малки стойности. Да се принтира новият
#списък, както и оригиналният. Програма трябва да генерира подходящо съобщение за
#грешка, ако потребителят въведе по-малко от 4 стойности.

# First create empty list
l = []

# Than have to define 'n'

n = int(input('Write digit to define numbers of digit in the list: '))
if n < 4:
    print('Please insert digit bigger than 4')
    n = int(input('Write digit to define numbers of digit in the list: '))
 
for numb in range(n):
   
    numb = int(input('Write digit: '))
    l.append(numb) 
    l.sort()
    print('Original list is: ', l)
    
del l[0:2]
#ln = l[:len(l) - 2]
ln = l[:-2]
print('New list is: ', ln)
