#Задача 6. Да се напише програма, която генерира всички подсписъци на даден списък.
#Например, списъците на [1, 2, 3] са [], [1], [2], [3], [1, 2], [2, 3], [1, 3] и [1, 2, 3].
l_given = [1, 2, 3]
l_result = [[]]
for i in l_given:
    l_result += [subl + [i] for subl in l_result]

print(*(l_result))

    









